# AddSingle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionFilterElement..::..AddSingle Method
SelectionFilterElement Class See Also
---
Adds a single ElementId to the filter's set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void AddSingle(
	ElementId id
)
```

Visual Basic
---
```text
Public Sub AddSingle ( _
	id As ElementId _
)
```

Visual C++
---
```text
public:
void AddSingle(
	ElementId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementId The ElementId to add.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Invalid ElementId |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace